Integration/SOAP/SOAPInsertAccount.txt

<?xml version="1.0" encoding="utf-8"?>   
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:urn="urn:enterprise.soap.sforce.com"
  xmlns:urn1="urn:sobject.enterprise.soap.sforce.com"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
     <urn:SessionHeader>
        <urn:sessionId>00D6g000000DoJv!ARwAQMGVXldCk59PxIHntnECDm1nNG_aUxA6FPEOQFrAPC.L5VnAQqufDt96K01Jp9yfzGhn0u4AxK9CWqRqLHhtkFDYUTNb</urn:sessionId>
     </urn:SessionHeader>
     <urn:MruHeader>
         <urn:updateMru>true</urn:updateMru>
     </urn:MruHeader>
  </soapenv:Header>
  <soapenv:Body>
    <urn:create>
        <urn:sObjects xsi:type="urn1:Account">
            <Name>SOAP Insert</Name>
        </urn:sObjects>
    </urn:create>
  </soapenv:Body>
</soapenv:Envelope>