soap-api-create-parent-child-records.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
    <urn:SessionHeader>
      <urn:sessionId>{{SessionId}}</urn:sessionId>
    </urn:SessionHeader>
  </soapenv:Header>
  <soapenv:Body>
    <urn:create>
        <urn:sObjects xsi:type="urn1:Account">
            <Name>United Finance Pte. Ltd.</Name>
            <Website>https://www.unitedfinance.com</Website>
            <External_Id__c>A3002</External_Id__c>
      </urn:sObjects>
        <urn:sObjects xsi:type="urn1:Contact">
            <FirstName>Jason</FirstName>
            <LastName>Stone</LastName>
            <urn1:Account>
                 <External_Id__c>A3002</External_Id__c>
            </urn1:Account>
      </urn:sObjects>
    </urn:create>
  </soapenv:Body>
</soapenv:Envelope>
